// © Copyright 2010-2015 HP Development Company, L.P.

// SSMDeviceWorkflowManager

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Työnkulun kopiointi epäonnistui";
"COPY_WORKFLOWS_DESC" = "Työnkulkujen kopiointi käyttäjälaitteen domain-kansioon epäonnistui";

// generic error
"ERROR" = "Virhe";
"ERROR_UNKNOWN_DESC" = "Tapahtui tuntematon virhe.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Työnkulun luominen epäonnistui";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "Tuntematon virhe luotaessa työnkulkua. Yritä uudelleen.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Virhe luotaessa hakemistoa";
"ERROR_CREATING_DIR_DESC" = "Virhe luotaessa hakemistoa %@. Tarkista isäntäkansion käyttöoikeudet ja yritä uudelleen";

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Skannauspikavalintaa ei tueta";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Valittua skannauspikavalintaa ei voida suorittaa, koska ohjelmisto ei tunnista sitä. Valitse toinen skannauspikavalinta ja yritä uudelleen.";

"Your HP device has sent a status message. This message could not be saved" = "HP-laitteesi on lähettänyt tilaviestin. Viestiä ei voitu tallentaa";
